NicoHood/HoodLoader2/avr/boards.txt
#HoodLoader2 boards.txt file

menu.board=Board / Bootloader / USB-Core

##############################################################


HoodLoader2atmega16u2.name=HoodLoader2 16u2
HoodLoader2atmega16u2.build.core=arduino:arduino
HoodLoader2atmega16u2.bootloader.tool=arduino:avrdude
HoodLoader2atmega16u2.upload.tool=arduino:avrdude

# MCU properties
HoodLoader2atmega16u2.upload.maximum_size=12288
HoodLoader2atmega16u2.upload.maximum_data_size=512
HoodLoader2atmega16u2.build.mcu=atmega16u2

#general settings for all boards:
HoodLoader2atmega16u2.build.variant=HoodLoader2
HoodLoader2atmega16u2.build.board=HOODLOADER2
HoodLoader2atmega16u2.build.f_cpu=16000000L
HoodLoader2atmega16u2.vid.0=0x2341
HoodLoader2atmega16u2.pid.0=0x484C

#uploading settings
HoodLoader2atmega16u2.upload.speed=57600
HoodLoader2atmega16u2.upload.protocol=avr109
HoodLoader2atmega16u2.upload.disable_flushing=true
HoodLoader2atmega16u2.upload.use_1200bps_touch=true
HoodLoader2atmega16u2.upload.wait_for_upload_port=true

#fuses (HoodLoader2 only, not suitable for DFU)
HoodLoader2atmega16u2.bootloader.low_fuses=0xEF
HoodLoader2atmega16u2.bootloader.high_fuses=0xD8
HoodLoader2atmega16u2.bootloader.extended_fuses=0xFC
HoodLoader2atmega16u2.bootloader.unlock_bits=0x3F
HoodLoader2atmega16u2.bootloader.lock_bits=0x0F

#usb settings, manufacturer overwritten by the IDE because of the VID
HoodLoader2atmega16u2.build.vid=0x2341
HoodLoader2atmega16u2.build.pid=0x484C
HoodLoader2atmega16u2.build.usb_product="HoodLoader2 16u2"
HoodLoader2atmega16u2.build.usb_manufacturer="Nico Hood"
HoodLoader2atmega16u2.build.extra_flags={build.usb_flags} -DMAGIC_KEY_POS=(RAMEND-1) -DUSB_EP_SIZE=16


#Board selection (only important for burning bootloaders)
HoodLoader2atmega16u2.menu.board.uno=HoodLoader2 Uno
HoodLoader2atmega16u2.menu.board.uno.bootloader.file=HexFiles/HoodLoader2_0_5_Uno_atmega16u2.hex
HoodLoader2atmega16u2.menu.board.mega2560=HoodLoader2 Mega
HoodLoader2atmega16u2.menu.board.mega2560.bootloader.file=HexFiles/HoodLoader2_0_5_Mega_atmega16u2.hex
HoodLoader2atmega16u2.menu.board.dev=HoodLoader2 Dev
HoodLoader2atmega16u2.menu.board.dev.bootloader.file=HoodLoader2/HoodLoader2.hex

# DFU fuse settings are not suitable for HoodLoader2
HoodLoader2atmega16u2.menu.board.dfuuno=DFU + USB-Serial Uno
HoodLoader2atmega16u2.menu.board.dfuuno.bootloader.file=HexFiles/Arduino-COMBINED-dfu-usbserial-atmega16u2-Uno-Rev3.hex
HoodLoader2atmega16u2.menu.board.dfuuno.bootloader.low_fuses=0xEF
HoodLoader2atmega16u2.menu.board.dfuuno.bootloader.high_fuses=0xD9
HoodLoader2atmega16u2.menu.board.dfuuno.bootloader.extended_fuses=0xF4
HoodLoader2atmega16u2.menu.board.dfuuno.bootloader.unlock_bits=0x3F
HoodLoader2atmega16u2.menu.board.dfuuno.bootloader.lock_bits=0x0F
HoodLoader2atmega16u2.menu.board.dfumega2560=DFU + USB-Serial Mega
HoodLoader2atmega16u2.menu.board.dfumega2560.bootloader.file=HexFiles/Arduino-COMBINED-dfu-usbserial-atmega16u2-Mega2560-Rev3.hex
HoodLoader2atmega16u2.menu.board.dfumega2560.bootloader.low_fuses=0xEF
HoodLoader2atmega16u2.menu.board.dfumega2560.bootloader.high_fuses=0xD9
HoodLoader2atmega16u2.menu.board.dfumega2560.bootloader.extended_fuses=0xF4
HoodLoader2atmega16u2.menu.board.dfumega2560.bootloader.unlock_bits=0x3F
HoodLoader2atmega16u2.menu.board.dfumega2560.bootloader.lock_bits=0x0F
HoodLoader2atmega16u2.menu.board.dfu=DFU
HoodLoader2atmega16u2.menu.board.dfu.bootloader.file=HexFiles/BootloaderDFU_atmega16u2.hex
HoodLoader2atmega16u2.menu.board.dfu.bootloader.low_fuses=0xEF
HoodLoader2atmega16u2.menu.board.dfu.bootloader.high_fuses=0xD9
HoodLoader2atmega16u2.menu.board.dfu.bootloader.extended_fuses=0xF4
HoodLoader2atmega16u2.menu.board.dfu.bootloader.unlock_bits=0x3F
HoodLoader2atmega16u2.menu.board.dfu.bootloader.lock_bits=0x0F


##############################################################


HoodLoader2atmega32u2.name=HoodLoader2 32u2
HoodLoader2atmega32u2.build.core=arduino:arduino
HoodLoader2atmega32u2.bootloader.tool=arduino:avrdude
HoodLoader2atmega32u2.upload.tool=arduino:avrdude

# MCU properties
HoodLoader2atmega32u2.upload.maximum_size=28672
HoodLoader2atmega32u2.upload.maximum_data_size=1024
HoodLoader2atmega32u2.build.mcu=atmega32u2

#general settings for all boards:
HoodLoader2atmega32u2.build.variant=HoodLoader2
HoodLoader2atmega32u2.build.board=HOODLOADER2
HoodLoader2atmega32u2.build.f_cpu=16000000L
HoodLoader2atmega32u2.vid.0=0x2341
HoodLoader2atmega32u2.pid.0=0x484D

#uploading settings
HoodLoader2atmega32u2.upload.speed=57600
HoodLoader2atmega32u2.upload.protocol=avr109
HoodLoader2atmega32u2.upload.disable_flushing=true
HoodLoader2atmega32u2.upload.use_1200bps_touch=true
HoodLoader2atmega32u2.upload.wait_for_upload_port=true

#fuses (HoodLoader2 only, not suitable for DFU)
HoodLoader2atmega32u2.bootloader.low_fuses=0xEF
HoodLoader2atmega32u2.bootloader.high_fuses=0xD8
HoodLoader2atmega32u2.bootloader.extended_fuses=0xFC
HoodLoader2atmega32u2.bootloader.unlock_bits=0x3F
HoodLoader2atmega32u2.bootloader.lock_bits=0x0F

#usb settings, manufacturer overwritten by the IDE because of the VID
HoodLoader2atmega32u2.build.vid=0x2341
HoodLoader2atmega32u2.build.pid=0x484D
HoodLoader2atmega32u2.build.usb_product="HoodLoader2 32u2"
HoodLoader2atmega32u2.build.usb_manufacturer="Nico Hood"
HoodLoader2atmega32u2.build.extra_flags={build.usb_flags} -DMAGIC_KEY_POS=(RAMEND-1) -DUSB_EP_SIZE=16


#Board selection (only important for burning bootloaders)
HoodLoader2atmega32u2.menu.board.uno=HoodLoader2 Uno
HoodLoader2atmega32u2.menu.board.uno.bootloader.file=HexFiles/HoodLoader2_0_5_Uno_atmega32u2.hex
HoodLoader2atmega32u2.menu.board.mega2560=HoodLoader2 Mega
HoodLoader2atmega32u2.menu.board.mega2560.bootloader.file=HexFiles/HoodLoader2_0_5_Mega_32u2.hex
HoodLoader2atmega32u2.menu.board.dev=HoodLoader2 Dev
HoodLoader2atmega32u2.menu.board.dev.bootloader.file=HoodLoader2/HoodLoader2.hex

# DFU fuse settings are not suitable for HoodLoader2
HoodLoader2atmega32u2.menu.board.dfu=DFU
HoodLoader2atmega32u2.menu.board.dfu.bootloader.file=HexFiles/BootloaderDFU_atmega32u2.hex
HoodLoader2atmega32u2.menu.board.dfu.bootloader.low_fuses=0xEF
HoodLoader2atmega32u2.menu.board.dfu.bootloader.high_fuses=0xD9
HoodLoader2atmega32u2.menu.board.dfu.bootloader.extended_fuses=0xF4
HoodLoader2atmega32u2.menu.board.dfu.bootloader.unlock_bits=0x3F
HoodLoader2atmega32u2.menu.board.dfu.bootloader.lock_bits=0x0F

